Константы типа **char** 
```
char a1 {'A'};
char a2 {65};
```
Существуют так называемые **управляющие** символы. Они начинаются со знака \
Управляющие символы не имеют графического представления
Примеры:
```
\a - звуковой сигнал,
\n - перевод строки,
\t - горизонтальная табуляция.
```
для представления символов: `\, ', ?, ", (\\, \', \?, \")`
Для представления символов с помощью шестнадцатеричных или восьмеричных кодов `(\073, \00F5)`
^^^^^     ^^^^^
8-ная       16-ная

## Логический тип
Содержит 2 константы true и false, под значение типа выделяется 1 байт.
```
#include <iostream>

int main()
{
	bool isAlive {true};
	boot isDead {false};
	cout << "isAlive: " << isAlive << endl;
	cout << "isDead: " << isDead << endl;
}
```

## Логические операции
! - операция отрицания, унарная операция. 

###### Остальные операции бинарные:
`&&` - конъюнкция
`||` - дизъюнкция
`^` - XOR (eXclusive OR), двоичное сложение

### Объединение операций сравнения
При использовании комбинированных условий необходимо учитывать приоритет операции, причём операции сравнения имеют больший приоритет, чем логические операции.

$------------->$ 
`pow(x, 0.5) && x > 0` - Runtime Error
`x > 0 && pow(x, 0.5)` - Корректно

#### Операторы
конъюнкция и дизъюнкция являются операторами сокращённого вычисления, то есть если вычисление первого операнда достаточно для вычисления всего выражения, то результат формируется без вычисления остальных операторов.

`F = x1 || x2 || x3`
`F = x1 || x2 || x3 && x5)`

## Арифметические выражения
Арифметическое выражение - это последовательность операций, констант и переменных, возможно объединённых скобками. Тип результата арифметического выражения определяется типом используемых в нём операций

```
i++; - операция инкремента (постфиксная)
++i; - операция инкремента (префиксная)
i--; - операция декремента
--i; - операция декремента
```
Эти операции могут записываться в префиксной и постфиксной форме.
При использовании инкремента и декремента в арифметическом выражении, префиксная форма имеет наивысший приоритет, постфиксная - наименьший.
```
int i=10, j=10;
int a = i++; // a = 10; i = 11
int b = ++j; // b = 11; j = 11
```

```
int a1=4, a2=4;
double b = 2.4*++a1 // 12
double c = 2.4*a2++ // 9.6
// a1 = a2 = 5
```

## Математические константы
Начиная со стандарта C++20 стандартная библиотека предоставляет модуль numbers, который содержит ряд встроенных математических констант
```
std::numbers::e // = 2.71.82.8

std::numbers::pi // = 3.14159

std::numbers::sqrt2 // квадратный корень двойки

std::numbers::phi // число Фидия
```

Для использования математических функция необходимо подключить стандартную библиотеку `<cmath>` (`<math>`)

## Условная операция
**Синтаксис:**
`Выражение1 ? Выражение3 : Выражение3`
**Семантика:**
Вычисляется *Выражение1* , при ненулевом результате используется *Выражение2* , в противном случае используется *Выражение3*
**Например:**
`x<0 ? -x: x; // вычисляется абсолютное значение x.`

## Поразрядные операции
работают с двоичным представлением значений переменных или констант
```
unsigned char var = 153; // двочная запись 10011001
unsigned char not = ~var; // результат 01100110 (число 102)
```
**`~`** - инверсия

```
unsigned char var = 153; // двочная запись 10011001
unsigned char msk = 0x11; //число 00010001 (число 17)
unsigned char res = var & mask; // результат 00010001
ИЛИ
var &= mask; // то же самое, что и var = var & mask;
```
**`&`** - поразрядная конъюнкция

**`|`** - побитовая дизъюнкция

**`^`** - побитовый XOR

## Операции сдвига
Каждое число представляется в памяти в виде определённого количества бит.
Операции сдвига позволяют перемещать значения бит влево или вправо.

```
<< Сдвигает битовое представление числа влево на определённое количество разрядов, которое задаётся вторым операндом

>> Сдвигает битовое представление числа вправо на определённое количество разрядов.
```

$$
x = 10_{10} = 1010_2
$$
Пример
```
unsigned int a = 2<<2; //10 на два разряда влево = 1000 = 8

unsigned int b = 16>>3; //10000 на три вправо = 10 = 2
```