## Представление неориентированных графов
В неориентированном графе дуги, соединяющие вершины не имеют направления, поэтому при представлении матрицей смежности, матрица будет симметрична, относительно главной диагонали.
Второе представление графа также список смежности.

## Остовные деревья минимальной стоимости
Пусть $G=(V,E)$ - связный граф, где каждое ребро имеет стоимость. **Остовным** деревом графа $G$ называется свободное дерево, содержащее все вершины графа $G$
Стоимость Остовного дерева вычисляется как сумма стоимостей всех рёбер этого дерева

### Свойства ОДМС (Остовного дерева минимальной стоимости)
Обозначим через $U$ подмножество вершин $V$
Если ребро $(u, v)$ - такое ребро наименьшей стоимости, что $u \in U$ и $v \in V/U$, тогда для графа $G$ существует остовное дерево минимальной стоимости, содержащее ребро $(u, v)$


## Алгоритм Прима
Пусть $V = \{1,2,...,n\}$ . Сначала множество $U = \{1\}$, на каждом шаге алгоритма необходимо найти ребро наименьшей стоимости $(u,v)$, такое что $u \in U$ и $v \in V\backslash U$ 
Затем вершина $v$ переносится во множество $U$
Алгоритм заканчивает работу, когда $U = V$ 

```c++
void Prim (граф G, множество рёбер T);
множество вершин U;
вершина v, u;
{
  T = 0;
  U = {1};
  while (U != V)
  {
    нахождение ребра (u,v) наименьшей стоимости и такого, что u in U и v in V\U

    T = T \∪ {(u,v)}; // объединение
    U = U \∪ {v}; // объединение
  }
}
```

```c++
#define SIZE 6
int main() {
  int a[SIZE+1][SIZE+1]; // матрица связей
  int y[2][SIZE+1]; // массив ребер остовного дерева
  int v[SIZE+1];
  int w1, w2, index = 0, min;
  // ... ввод матрицы связей, если нет ребра
  a[i][j] = 1000;
  // Инициализация не посещённых вершин
  for (int i = 2; i <= SIZE; i++) v[i] = 1;
  v[1] = 0; // вершину посетили

	do {
	  min = 1000;
	  for (int i = 1; i <= SIZE; i++)
	    for (int j = 1; j <= SIZE; j++) {
	      // Усли вершину j ещё не обошли, а вершину i обошли и вес меньше min
		  if ((v[i] == 0) && (v[j] == 1) && (a[i][j] < min)) {
		    //Переприсваиваем значения
		    min = a[i][j];
		    w1 = i; // новое ребро в остовное дерево
		    w2 = j;
		  }
	    }
	v[w2] = 0;
	t[0][index] = w1;
	t[1][index] = w2;
	index++;
	}
	while (min < 1000);
	//вывод  ребер остовного дерева
	for (int i = 0; i < index; i++)
	  cout << "( " << t[0][i] << ";" << t[1][i] << ")" << endl;
}
```


## Алгоритм Крускала
Пусть $G=(V,E)$ связный граф со множеством вершин $V=\{1,2,...,n\}$ и функцией стоимостей $C$, определённой на множестве рёбер $E$.

```c++
#define SIZE 6
int a[SIZE+1][SIZE+1]; // Матрица связей
int w1, w2;
void min(){ //поиск ребра наименьшей стоимости
  int m = 1000;
  for (int i = 1; i <= SIZE; i++)
    for (int j = 1; j <= SIZE; j++) 
      if (m > a[i][j]) {
        m = a[i][j]; w1 = i ; w2 = j;
      }
  if (m != 1000) a[w1][w2] = 1000; //убать ребро из дальнейшего просмотра
  else w1 = -1; // маркер рёбер больше нет
}
int main() {
  int t[2][SIZE+1]; // массив ребер остовного дерева
  int v[SIZE+1]; // компоненты связности
  int index = 0;
  // ... ввод матрицы связей, если нет ребра
  a[i][j] = 1000;
  for (int i = 1; i <= SIZE; i++)
    v[i] = i; // каждая вершина принадлежит своей компоненте
  // Шаг алгоритма 
  do {
    min(); // (w1, w2) ребро наименьшей стоимости
    if (v[w1] == v[w2]) {
      t[1][index] = w2; index++; // берем ребро в дерево
      int temp = v[w2];
      for (int i = 1; i <= SIZE; i++) { // и присваиваем им номер
        if (v[i] == temp) // одной компоненты, все вершины из комп w2
          v[i] = v[w1]; // получают номер компоненты w1
        else
          a[w1][w2] = 1000;
      }
    }
  } while (w1 > 1);
  for (int i = 0; i < index; i++) {
	  cout << "( " << t[0][i] << " " << t[1][i] << ", )" << endl;
  }
}
```

